Redt/app/controllers/links_controller.rb

   def create
  	@link = Link.create(link_url: params[:link][:link_url], user_id: current_user.id)
---
INSERT INTO "links" ("created_at", "link_url", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 08 Apr 2014 23:58:54 UTC +00:00], ["link_url", "asgasg"], ["updated_at", Tue, 08 Apr 2014 23:58:54 UTC +00:00], ["user_id", 2]]

  def edit
  	@link = Link.find(params[:id])
---
SELECT "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", "1"]]

  def update
  	@link = Link.find(params[:id])
---
SELECT "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", "4"]]