Redt/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["email", "tommy@spencer"], ["updated_at", Tue, 08 Apr 2014 22:52:56 UTC +00:00]]
---
  def update
    @user = User.find(params[:id])
    if current_user == @user
      @user.update(user_params)