Redt/app/views/users/show.html.erb


<% @user.links.each do|link| %>
---
SELECT "links".* FROM "links" WHERE "links"."user_id" = $1  [["user_id", 1]]